<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1></h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2009/08/pythonrio-na-dev-in-rio.html">Previous</a>
&nbsp; 
<a href="../../../index.html">Index</a>
&nbsp; 
<a href="../../../posts/2009/08/primeiro-web2py-hack-day-em-niteroi.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Encerramento da segunda edição do CEFET Summer of Code</h3>
<div class='post_info'>
<span class='post_time'>August  7 2009, 11:27 AM</span>
<span class='author'>&nbsp;by email</span>
</div>
</div>
<div class='post_body'><p>Ontem tivemos a comemora&ccedil;&atilde;o do encerramento de mais um <a href="http://groups.google.com.br/group/CSoC" target="_blank">curso de Python</a> no <a href="http://www.cefet-rj.br/" target="_blank">CEFET/RJ</a>! Abaixo descrevo em maiores detalhes as 8 aulas que tivemos durante os meses de julho e agosto.<p /> Inicialmente, as f&eacute;rias de julho me pareceram muito curtas para a realiza&ccedil;&atilde;o do curso, mas, ap&oacute;s o incentivo de alguns membros da <a href="http://pythonrio.org/" target="_blank">PythOnRio</a>, decidi que valia a pena tentar.<p /> A divulga&ccedil;&atilde;o foi feita mais uma vez por e-mail, dessa vez contando com a ajuda de alguns amigos para espalhar a not&iacute;cia. O n&uacute;mero de pessoas atingidas foi bom, e conseguimos um qu&oacute;rum razo&aacute;vel. Ao mesmo tempo, entrei em contato com o coordenador da COLAN, o laborat&oacute;rio que usamos no come&ccedil;o do ano, e ele disse que eles estariam em manuten&ccedil;&atilde;o nas f&eacute;rias, mas que era poss&iacute;vel conciliar.<p /> A <a href="http://csoc.googlegroups.com/web/aula01.pdf?gda=VGvZdT8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4RG8yhHBg4TnTQTes5IT3BFBzwIP9m7S-GycXvhYbIhV" target="_blank">primeira aula</a> come&ccedil;ou com um atraso de quase uma hora, devido a alguns imprevistos na manuten&ccedil;&atilde;o do laborat&oacute;rio, mas correu bem. Cerca de 10 alunos aprenderam sobre conceitos b&aacute;sicos de programa&ccedil;&atilde;o usando a linguagem C.<p /> Na <a href="http://csoc.googlegroups.com/web/aula02.pdf?gda=xB84lj8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4Xz4rCiuhzdh2vQ6weQp6R9BzwIP9m7S-GycXvhYbIhV" target="_blank">segunda aula</a> tamb&eacute;m tivemos problemas com o laborat&oacute;rio, e mais uma vez come&ccedil;amos bem atrasados. A surpresa foi o n&uacute;mero de participantes: 18! Novo recorde! Sem cadeiras sobrando, vimos conceitos de orienta&ccedil;&atilde;o a objetos usando a linguagem C++. Vale ressaltar a presen&ccedil;a do nosso amigo <a href="http://mudadeideia.com.br/" target="_blank">Israel Teixeira</a>, que apareceu para dar uma for&ccedil;a!<p /> Nesse mesmo dia, decidi experimentar <a href="http://improveit.com.br/xp/praticas/programacao_par" target="_blank">Programa&ccedil;&atilde;o em Pares</a> com os alunos, visando aumentar a concentra&ccedil;&atilde;o, diminuir erros de sintaxe e integrar a turma. Comparando os resultados com os da primeira edi&ccedil;&atilde;o,  a t&eacute;cnica se mostrou muito eficiente, e por isso a adotamos durante o restante do curso.<p /> Na <a href="http://csoc.googlegroups.com/web/aula04.pdf?gda=ucqZkD8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4T6R428JY7X3Kqb3dO9l3dhBzwIP9m7S-GycXvhYbIhV" target="_blank">terceira aula</a> come&ccedil;amos a ver <a href="http://www.python.org/" target="_blank">Python</a> (ufa!). Usando a vers&atilde;o <a href="http://www.python.org/download/releases/3.1/" target="_blank">3.1</a> -- rec&eacute;m sa&iacute;da do forno -- vimos os conceitos b&aacute;sicos da linguagem e fizemos um comparativo com o que t&iacute;nhamos visto em C.<p /> Na <a href="http://csoc.googlegroups.com/web/aula05.pdf?gda=qDF8BD8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4TG-C7qu5DTx_HJGpCTE7plBzwIP9m7S-GycXvhYbIhV" target="_blank">quarta aula</a> vimos os conceitos de <em>strings</em>, listas, tuplas e dicion&aacute;rios.<p /> A <a href="http://csoc.googlegroups.com/web/aula06.pdf?gda=Vc95uj8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4USww9-p4NG3_Gq3d0lQ-N5BzwIP9m7S-GycXvhYbIhV" target="_blank">quinta aula</a> apresentou orienta&ccedil;&atilde;o a objetos em Python, comparando com o que t&iacute;nhamos visto em C++.<p /> Na <a href="http://csoc.googlegroups.com/web/aula07.pdf?gda=gQKw2z8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4W_AqeVF_gjp9GOx8nsbGU9BzwIP9m7S-GycXvhYbIhV" target="_blank">sexta aula</a> falamos sobre boas pr&aacute;ticas de codifica&ccedil;&atilde;o e vimos como usar o Python para obter ajuda. Al&eacute;m disso, foram apresentados alguns m&oacute;dulos da biblioteca padr&atilde;o.<p /> Na reta final do curso, a id&eacute;ia era que os alunos aprendessem a se virar sozinhos. Desse modo, na <a href="http://csoc.googlegroups.com/web/aula08.pdf?gda=R4XH7z8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4RRmjhk8dlKQB_hv6EhuqjJBzwIP9m7S-GycXvhYbIhV" target="_blank">s&eacute;tima aula</a> vimos como interpretar e tratar os erros e exce&ccedil;&otilde;es em Python, al&eacute;m de mais alguns m&oacute;dulos da biblioteca padr&atilde;o.<p /> A <a href="http://csoc.googlegroups.com/web/aula09.pdf?gda=StYscT8AAAC-0FnWnZgMZ-H3Idgilq_bwHNINbAnQQWm4u2FrfqE4eF6xLgtnmywZXZ-JNRJqf9BzwIP9m7S-GycXvhYbIhV" target="_blank">oitava e &uacute;ltima aula</a> foi a cereja no bolo. Falamos sobre t&oacute;picos avan&ccedil;ados, incluindo programa&ccedil;&atilde;o funcional, heran&ccedil;a m&uacute;ltipla e sobrecarga de operadores.<p /> Infelizmente o n&uacute;mero de participantes foi diminuindo ao longo das aulas, e no &uacute;ltimo dia tivemos s&oacute; 4 presentes (al&eacute;m de 2 participantes da primeira edi&ccedil;&atilde;o, que compareceram e participaram da grande maioria das aulas). No geral, tivemos uma m&eacute;dia de 6 a 8 alunos que compareceram &agrave;s aulas com regularidade.<p /> Para a pr&oacute;xima edi&ccedil;&atilde;o, vejo que podemos fazer algumas melhorias:</p>
<ul>
<li>Fazer a divulga&ccedil;&atilde;o mais <em>t&ecirc;te-&agrave;-t&ecirc;te</em> e menos virtual. Isso pode ajudar a diminuir o n&uacute;mero de "curiosos", e a identificar aqueles que realmente tem interesse em participar;</li>
<li>Aproveitar <a href="http://henriquebastos.net/2009/08/02/dinamica-para-mini-cursos-de-python/" target="_blank">algumas id&eacute;ias do Henrique Bastos</a> e fazer um mapeamento de expectativas no primeiro dia, e uma se&ccedil;&atilde;o de <em>feedback</em> no &uacute;ltimo. </li>
<li>Planejar o uso do laborat&oacute;rio com maior anteced&ecirc;ncia, para evitar alguns dos problemas que tivemos com infraestrutura.</li>
<li>Analisar a viabilidade de conseguirmos um <em>datashow</em> para usarmos na aula, o que pode ajudar muito (atualmente estamos usando o quadro branco).</li>
</ul>
<p>Nos dois &uacute;ltimos dias, levei uma vers&atilde;o do <a href="http://www.portablepython.com/" target="_blank">PortablePython</a> e mostrei informalmente o <a href="http://ipython.scipy.org/" target="_blank">IPython</a> e o m&oacute;dulo <a href="http://www.scipy.org/" target="_blank">Scipy</a>. Todos gostaram da id&eacute;ia de realizarmos um [mini]curso de Python para computa&ccedil;&atilde;o cient&iacute;fica (leia-se: "Python ao inv&eacute;s de Matlab").<p /> Mesmo com pouca gente, ao final do curso fomos comemorar no Pizza e Grill da Tijuca (veja as fotos abaixo).</p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2009/08/1224607-CSoC-2_01.jpg'>
<img src='../../../image/2009/08/1224608-CSoC-2_02.jpg'>
<img src='../../../image/2009/08/1224609-CSoC-2_03.jpg'>
<img src='../../../image/2009/08/1224610-CSoC-2_04.jpg'>
<img src='../../../image/2009/08/1224611-CSoC-2_05.jpg'>
<img src='../../../image/2009/08/1224612-CSoC-2_06.jpg'>
<img src='../../../image/2009/08/1224613-CSoC-2_07.jpg'>
<img src='../../../image/2009/08/1224614-CSoC-2_08.jpg'>
<img src='../../../image/2009/08/1224615-CSoC-2_09.jpg'>
</div>
</p>
<p>E que venha o pr&oacute;ximo!<p />Um abra&ccedil;o,<br /><span style="color: #888888;">Alex Tercete</span></p></div>
<div class='post_responses'>
<h4>6617 views and 4 responses</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Aug  7 2009, 12:14 PM</div>
<div class='response_name'>Luiz Guilherme Aldabalde responded:</div>
</div>
<div class='response_body'>Muito bom , Alex !!<p>Parabéns !!</p><p>Ações com esta é que fazem a diferença.</p><p>Cada um faz uma parte e daí vêm a força do nosso grupo. </p><p>Mais uma vez,  parabéns pelo esforço de todos envolvidos.</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Aug  8 2009,  5:57 AM</div>
<div class='response_name'>Henrique Bastos responded:</div>
</div>
<div class='response_body'>Excelente!<br />Inspirador esse relato! Parabéns Alex e todo o pessoal que participou desta iniciativa. Fica desde já o convite para conhecerem o DojoRio e todas as nossas outras reuniões.<br />[]'s!!</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Aug  8 2009, 11:03 AM</div>
<div class='response_name'>Rodolfo Carvalho responded:</div>
</div>
<div class='response_body'>Parabéns Alex! Excelente curso, que venham os próximos.</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Aug 23 2009, 11:53 AM</div>
<div class='response_name'>Sérgio Lima responded:</div>
</div>
<div class='response_body'>Quando será o próximo curso? Tô super-afim de fazer.<p>abs</p></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
